**free

dcl-s othertext char(52); // Hello

othertext = 'Goodbye';
// Hello world

dsply othertext;

if (othertext = 'Hello');
  dsply 'Hello world';
  if (*on);
    Dsply 'other thing';
  endif;
endif;

return;
